Deadline039/STM32F1xx-HAL-CSP/Config/CSP_Config.h
/**
 * @file    CSP_Config.h
 * @author  Deadline039
 * @brief   The CSP configuration of STM32F1xx.
 * @version 3.3.2
 * @date    2024-10-22
 * @note    Reference the CMSIS RTE Devices.
 */

//-------- <<< Use Configuration Wizard in Context Menu >>> --------------------

#ifndef __CSP_CONFIG_H
#define __CSP_CONFIG_H

// <e> USART1 (Universal synchronous asynchronous receiver transmitter)
#define USART1_ENABLE 1

#if USART1_ENABLE

//   <o> USART1 IO Remap
//        <0=>No remap (TX/PA9, RX/PA10, CTS/PA11, RTS/PA12)
//        <1=>Remap    (TX/PB6, RX/PB7,  CTS/PA11, RTS/PA12)
#define USART1_IO_REMAP   0

//   <q> Enable USART1 TX
#define USART1_TX_ENABLE  1
//   <q> Enable USART1 RX
#define USART1_RX_ENABLE  1
//   <q> Enable USART1 CTS
#define USART1_CTS_ENABLE 0
//   <q> Enable USART1 RTS
#define USART1_RTS_ENABLE 0

#if (USART1_IO_REMAP == 0)
#define USART1_AFIO_REMAP() __HAL_AFIO_REMAP_USART1_DISABLE()
#if USART1_TX_ENABLE
#define USART1_TX_PORT A
#define USART1_TX_PIN  GPIO_PIN_9
#endif
#if USART1_RX_ENABLE
#define USART1_RX_PORT A
#define USART1_RX_PIN  GPIO_PIN_10
#endif
#if USART1_CTS_ENABLE
#define USART1_CTS_PORT A
#define USART1_CTS_PIN  GPIO_PIN_11
#endif
#if USART1_RTS_ENABLE
#define USART1_RTS_PORT A
#define USART1_RTS_PIN  GPIO_PIN_12
#endif
#elif (USART1_IO_REMAP == 1)
#define USART1_AFIO_REMAP() __HAL_AFIO_REMAP_USART1_ENABLE()
#if USART1_TX_ENABLE
#define USART1_TX_PORT B
#define USART1_TX_PIN  GPIO_PIN_6
#endif
#if USART1_RX_ENABLE
#define USART1_RX_PORT B
#define USART1_RX_PIN  GPIO_PIN_7
#endif
#if USART1_CTS_ENABLE
#define USART1_CTS_PORT A
#define USART1_CTS_PIN  GPIO_PIN_11
#endif
#if USART1_RTS_ENABLE
#define USART1_RTS_PORT A
#define USART1_RTS_PIN  GPIO_PIN_12
#endif
#else
#error "Invalid USART1 IO Remap Configuration! "
#endif

//   <o> USART1 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of USART1
#define USART1_IT_PRIORITY        2
//   <o> USART1 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of USART1
#define USART1_IT_SUB             3

//   <e> DMA Rx
#define USART1_RX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define USART1_RX_DMA_NUMBER      1
//     <o>  Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
#define USART1_RX_DMA_CHANNEL     5
//     <o USART1_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define USART1_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define USART1_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define USART1_RX_DMA_IT_SUB      2
//     <o>  The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define USART1_RX_DMA_BUF_SIZE    256
//     <o>  The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define USART1_RX_DMA_FIFO_SIZE   256
//   </e>

//   <e> DMA Tx
#define USART1_TX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define USART1_TX_DMA_NUMBER      1
//     <o>  Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
#define USART1_TX_DMA_CHANNEL     4
//     <o USART1_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define USART1_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define USART1_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define USART1_TX_DMA_IT_SUB      4
//     <o>  The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
#define USART1_TX_DMA_BUF_SIZE    256
//   </e>

#endif /* USART1_ENABLE */

// </e>

// <e> USART2 (Universal synchronous asynchronous receiver transmitter)
#define USART2_ENABLE 0

#if USART2_ENABLE

//   <o> USART2 IO Remap
//        <0=>No remap (TX/PA2, RX/PA3, CTS/PA0, RTS/PA1)
//        <1=>Remap    (TX/PD5, RX/PD6, CTS/PD3, RTS/PD4)
#define USART2_IO_REMAP   1

//   <q> Enable USART2 TX
#define USART2_TX_ENABLE  1
//   <q> Enable USART2 RX
#define USART2_RX_ENABLE  1
//   <q> Enable USART2 CTS
#define USART2_CTS_ENABLE 0
//   <q> Enable USART2 RTS
#define USART2_RTS_ENABLE 0

#if (USART2_IO_REMAP == 0)
#define USART2_AFIO_REMAP() __HAL_AFIO_REMAP_USART2_DISABLE()
#if USART2_TX_ENABLE
#define USART2_TX_PORT A
#define USART2_TX_PIN  GPIO_PIN_2
#endif
#if USART2_RX_ENABLE
#define USART2_RX_PORT A
#define USART2_RX_PIN  GPIO_PIN_3
#if USART2_CTS_ENABLE
#define USART2_CTS_PORT A
#define USART2_CTS_PIN  GPIO_PIN_0
#endif
#if USART2_RTS_ENABLE
#define USART2_RTS_PORT A
#define USART2_RTS_PIN  GPIO_PIN_1
#endif
#endif
#elif (USART2_IO_REMAP == 1)
#define USART2_AFIO_REMAP() __HAL_AFIO_REMAP_USART2_ENABLE()
#if USART2_TX_ENABLE
#define USART2_TX_PORT D
#define USART2_TX_PIN  GPIO_PIN_5
#endif
#if USART2_RX_ENABLE
#define USART2_RX_PORT D
#define USART2_RX_PIN  GPIO_PIN_6
#endif
#if USART2_CTS_ENABLE
#define USART2_CTS_PORT D
#define USART2_CTS_PIN  GPIO_PIN_3
#endif
#if USART2_RTS_ENABLE
#define USART2_RTS_PORT D
#define USART2_RTS_PIN  GPIO_PIN_4
#endif
#else
#error "Invalid USART2 IO Remap Configuration! "
#endif

//   <o> USART2 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of USART2
#define USART2_IT_PRIORITY        2
//   <o> USART2 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of USART2
#define USART2_IT_SUB             3

//   <e> DMA Rx
#define USART2_RX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define USART2_RX_DMA_NUMBER      1
//     <o>  Channel <6=>6
//     <i>  Selects DMA Channel (only Channel 6 can be used)
#define USART2_RX_DMA_CHANNEL     6
//     <o USART2_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define USART2_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define USART2_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define USART2_RX_DMA_IT_SUB      2
//     <o>  The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define USART2_RX_DMA_BUF_SIZE    256
//     <o>  The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define USART2_RX_DMA_FIFO_SIZE   256
//   </e>

//   <e> DMA Tx
#define USART2_TX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define USART2_TX_DMA_NUMBER      1
//     <o>  Channel <7=>7
//     <i>  Selects DMA Channel (only Channel 7 can be used)
#define USART2_TX_DMA_CHANNEL     7
//     <o USART2_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define USART2_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define USART2_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define USART2_TX_DMA_IT_SUB      4
//     <o>  The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
#define USART2_TX_DMA_BUF_SIZE    256
//   </e>

#endif /* USART2_ENABLE */

// </e>

// <e> USART3 (Universal synchronous asynchronous receiver transmitter)
#define USART3_ENABLE 0

#if USART3_ENABLE

//   <o> USART3 IO Remap
//        <0=>No remap        (TX/PB10, RX/PB11, CTS/PB13, RTS/PB14)
//        <1=>Partial Remap   (TX/PC10, RX/PC11, CTS/PB13, RTS/PB14)
//        <2=>Full Remap      (TX/PD8,  RX/PD9,  CTS/PD11, RTS/PD12)
#define USART3_IO_REMAP   1

