Deadline039/STM32F1xx-HAL-CSP/Config/CSP_Config.h
//   <q> Enable USART3 TX
#define USART3_TX_ENABLE  1
//   <q> Enable USART3 RX
#define USART3_RX_ENABLE  1
//   <q> Enable USART3 CTS
#define USART3_CTS_ENABLE 0
//   <q> Enable USART3 RTS
#define USART3_RTS_ENABLE 0

#if (USART3_IO_REMAP == 0)
#define USART3_AFIO_REMAP() __HAL_AFIO_REMAP_USART3_DISABLE()
#if USART3_TX_ENABLE
#define USART3_TX_PORT C
#define USART3_TX_PIN  GPIO_PIN_10
#endif
#if USART3_RX_ENABLE
#define USART3_RX_PORT C
#define USART3_RX_PIN  GPIO_PIN_11
#endif
#if USART3_CTS_ENABLE
#define USART3_CTS_PORT B
#define USART3_CTS_PIN  GPIO_PIN_13
#endif
#if USART3_RTS_ENABLE
#define USART3_RTS_PORT B
#define USART3_RTS_PIN  GPIO_PIN_14
#endif
#elif (USART3_IO_REMAP == 1)
#define USART3_AFIO_REMAP() __HAL_AFIO_REMAP_USART3_PARTIAL()
#if USART3_TX_ENABLE
#define USART3_TX_PORT C
#define USART3_TX_PIN  GPIO_PIN_10
#endif
#if USART3_RX_ENABLE
#define USART3_RX_PORT C
#define USART3_RX_PIN  GPIO_PIN_11
#endif
#if USART3_CTS_ENABLE
#define USART3_CTS_PORT B
#define USART3_CTS_PIN  GPIO_PIN_13
#endif
#if USART3_RTS_ENABLE
#define USART3_RTS_PORT B
#define USART3_RTS_PIN  GPIO_PIN_14
#endif
#elif (USART3_IO_REMAP == 2)
#define USART3_AFIO_REMAP() __HAL_AFIO_REMAP_USART3_ENABLE()
#if USART3_TX_ENABLE
#define USART3_TX_PORT D
#define USART3_TX_PIN  GPIO_PIN_8
#endif
#if USART3_RX_ENABLE
#define USART3_RX_PORT D
#define USART3_RX_PIN  GPIO_PIN_9
#endif
#if USART3_CTS_ENABLE
#define USART3_CTS_PORT D
#define USART3_CTS_PIN  GPIO_PIN_11
#endif
#if USART3_RTS_ENABLE
#define USART3_RTS_PORT D
#define USART3_RTS_PIN  GPIO_PIN_12
#endif
#else
#error "Invalid USART3 IO Remap Configuration! "
#endif

//   <o> USART3 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of USART3
#define USART3_IT_PRIORITY        2
//   <o> USART3 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of USART3
#define USART3_IT_SUB             3

//   <e> DMA Rx
#define USART3_RX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define USART3_RX_DMA_NUMBER      1
//     <o>  Channel <3=>3
//     <i>  Selects DMA Channel (only Channel 3 can be used)
#define USART3_RX_DMA_CHANNEL     3
//     <o USART3_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define USART3_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define USART3_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define USART3_RX_DMA_IT_SUB      2
//     <o>  The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define USART3_RX_DMA_BUF_SIZE    256
//     <o>  The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define USART3_RX_DMA_FIFO_SIZE   256
//   </e>

//   <e> DMA Tx
#define USART3_TX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define USART3_TX_DMA_NUMBER      1
//     <o>  Channel <2=>2
//     <i>  Selects DMA Channel (only Channel 2 can be used)
#define USART3_TX_DMA_CHANNEL     2
//     <o USART3_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define USART3_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define USART3_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define USART3_TX_DMA_IT_SUB      4
//     <o>  The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
#define USART3_TX_DMA_BUF_SIZE    256
//   </e>

#endif /* USART3_ENABLE */

// </e>

// <e> UART4 (Universal asynchronous receiver transmitter)
#define UART4_ENABLE 0

#if UART4_ENABLE

#ifndef DMA2_Channel5_IRQn
#define DMA2_Channel5_IRQn       DMA2_Channel4_5_IRQn
#define DMA2_Channel5_IRQHandler DMA2_Channel4_5_IRQHandler
#endif /* DMA2_Channel5_IRQn */

//   <q> Enable UART4 TX (PC10)
#define UART4_TX_ENABLE 1
//   <q> Enable UART4 RX (PC11)
#define UART4_RX_ENABLE 1

#if UART4_TX_ENABLE
#define UART4_TX_PORT C
#define UART4_TX_PIN  GPIO_PIN_10
#endif
#if UART4_RX_ENABLE
#define UART4_RX_PORT C
#define UART4_RX_PIN  GPIO_PIN_11
#endif

//   <o> UART4 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART4
#define UART4_IT_PRIORITY        2
//   <o> UART4 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART4
#define UART4_IT_SUB             3

//   <e> DMA Rx
#define UART4_RX_DMA             0
//     <o>  Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
#define UART4_RX_DMA_NUMBER      2
//     <o>  Channel <3=>3
//     <i>  Selects DMA Channel (only Channel 3 can be used)
#define UART4_RX_DMA_CHANNEL     3
//     <o UART4_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define UART4_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define UART4_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define UART4_RX_DMA_IT_SUB      2
//     <o>  The size of Receive buf [byte]
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define UART4_RX_DMA_BUF_SIZE    256
//     <o>  The size of Receive FIFO [byte] (Must be power of 2)
//     <i>  Using FIFO and Buf to implement high reliable USART Receive
#define UART4_RX_DMA_FIFO_SIZE   256
//   </e>

//   <e> DMA Tx
#define UART4_TX_DMA             0
//     <o>  Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
#define UART4_TX_DMA_NUMBER      2
//     <o>  Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
#define UART4_TX_DMA_CHANNEL     5
//     <o UART4_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define UART4_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define UART4_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define UART4_TX_DMA_IT_SUB      4
//     <o>  The size of Send buf [byte]
//     <i>  Write data to Send buf, and sending with thread safety
#define UART4_TX_DMA_BUF_SIZE    256
//   </e>

#endif /* UART4_ENABLE */

// </e>

// <e> UART5 (Universal synchronous asynchronous receiver transmitter)
#define UART5_ENABLE             0

