Deadline039/STM32F1xx-HAL-CSP/Config/CSP_Config.h
#if UART5_ENABLE

//   <q> Enable UART5 TX (PC12)
#define UART5_TX_ENABLE          1
//   <q> Enable UART5 RX (PD2)
#define UART5_RX_ENABLE          1

#if UART5_TX_ENABLE
#define UART5_TX_PORT C
#define UART5_TX_PIN  GPIO_PIN_12
#endif
#if UART5_RX_ENABLE
#define UART5_RX_PORT D
#define UART5_RX_PIN  GPIO_PIN_2
#endif

//   <o> UART5 Interrupt Priority <0-15>
//   <i> The Interrupt Priority of UART5
#define UART5_IT_PRIORITY 2
//   <o> UART5 Interrupt SubPriority <0-15>
//   <i> The Interrupt SubPriority of UART5
#define UART5_IT_SUB      3

#endif /* UART5_ENABLE */

// </e>

// <e> I2C1 (Inter-integrated Circuit Interface 1)
#define I2C1_ENABLE       0

#if I2C1_ENABLE

//   <o> I2C1 IO Remap
//        <0=>No remap   (SCL/PB6, SDA/PB7)
//        <1=>Remap      (SCL/PB8, SDA/PB9)
#define I2C1_IO_REMAP     0

#if (I2C1_IO_REMAP == 0)
#define I2C1_AFIO_REMAP() __HAL_AFIO_REMAP_I2C1_DISABLE()
#define I2C1_SCL_PORT     B
#define I2C1_SCL_PIN      GPIO_PIN_6
#define I2C1_SDA_PORT     B
#define I2C1_SDA_PIN      GPIO_PIN_7
#elif (I2C1_IO_REMAP == 1)
#define I2C1_AFIO_REMAP() __HAL_AFIO_REMAP_I2C1_ENABLE()
#define I2C1_SCL_PORT     B
#define I2C1_SCL_PIN      GPIO_PIN_8
#define I2C1_SDA_PORT     B
#define I2C1_SDA_PIN      GPIO_PIN_9
#else
#error "Invalid I2C1 IO Remap Configuration! "
#endif

//   <e> I2C1 Interrupt
//   <i> Must be enabled when using DMA.
#define I2C1_IT_ENABLE          0
//      <o> I2C1 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of I2C1
#define I2C1_IT_PRIORITY        2
//      <o> I2C1 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of I2C1
#define I2C1_IT_SUB             3
//   </e>

//   <e> DMA Rx
#define I2C1_RX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define I2C1_RX_DMA_NUMBER      1
//     <o>  Channel <7=>7
//     <i>  Selects DMA Channel (only Channel 7 can be used)
#define I2C1_RX_DMA_CHANNEL     7
//     <o I2C1_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define I2C1_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define I2C1_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define I2C1_RX_DMA_IT_SUB      2
//   </e>

//   <e> DMA Tx
#define I2C1_TX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define I2C1_TX_DMA_NUMBER      1
//     <o>  Channel <6=>6
//     <i>  Selects DMA Channel (only Channel 6 can be used)
#define I2C1_TX_DMA_CHANNEL     6
//     <o I2C1_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define I2C1_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define I2C1_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define I2C1_TX_DMA_IT_SUB      4
//   </e>

#endif /* I2C1_ENABLE */

// </e>

// <e> I2C2 (Inter-integrated Circuit Interface 2)
// <i> SCL/PB10, SDA/PB11
#define I2C2_ENABLE             0

#if I2C2_ENABLE

#define I2C2_SCL_PORT           B
#define I2C2_SCL_PIN            GPIO_PIN_10
#define I2C2_SDA_PORT           B
#define I2C2_SDA_PIN            GPIO_PIN_11

//   <e> I2C2 Interrupt
//   <i> Must be enabled when using DMA.
#define I2C2_IT_ENABLE          0
//      <o> I2C2 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of I2C2
#define I2C2_IT_PRIORITY        2
//      <o> I2C2 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of I2C2
#define I2C2_IT_SUB             3
//   </e>

//   <e> DMA Rx
#define I2C2_RX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define I2C2_RX_DMA_NUMBER      1
//     <o>  Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
#define I2C2_RX_DMA_CHANNEL     5
//     <o I2C2_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define I2C2_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define I2C2_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define I2C2_RX_DMA_IT_SUB      2
//   </e>

//   <e> DMA Tx
#define I2C2_TX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define I2C2_TX_DMA_NUMBER      1
//     <o>  Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
#define I2C2_TX_DMA_CHANNEL     4
//     <o I2C2_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define I2C2_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define I2C2_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define I2C2_TX_DMA_IT_SUB      4
//   </e>

#endif /* I2C2_ENABLE */

// </e>

// <e> SPI1 (Serial Peripheral Interface 1)
#define SPI1_ENABLE             0

#if SPI1_ENABLE

//   <o> SPI1 IO Remap
//        <0=>No remap   (NSS/PA4,  SCK/PA5, MISO/PA6, MOSI/PA7)
//        <1=>Remap      (NSS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5)
#define SPI1_IO_REMAP           0

//   <q> Enable SPI1 NSS
#define SPI1_NSS_ENABLE         0
//   <q> Enable SPI1 MISO
#define SPI1_MISO_ENABLE        0
//   <q> Enable SPI1 MOSI
#define SPI1_MOSI_ENABLE        0

#if (SPI1_IO_REMAP == 0)
#define SPI1_AFIO_REMAP() __HAL_AFIO_REMAP_SPI1_DISABLE()
#define SPI1_SCK_PORT     A
#define SPI1_SCK_PIN      GPIO_PIN_5
#if SPI1_NSS_ENABLE
#define SPI1_NSS_PORT A
#define SPI1_NSS_PIN  GPIO_PIN_4
#endif
#if SPI1_MISO_ENABLE
#define SPI1_MISO_PORT A
#define SPI1_MISO_PIN  GPIO_PIN_6
#endif
#if SPI1_MOSI_ENABLE
#define SPI1_MOSI_PORT A
#define SPI1_MOSI_PIN  GPIO_PIN_7
#endif
#elif (SPI1_IO_REMAP == 1)
#define SPI1_AFIO_REMAP()                                                      \
    do {                                                                       \
        __HAL_RCC_AFIO_CLK_ENABLE();                                           \
        __HAL_AFIO_REMAP_SWJ_NOJTAG();                                         \
        __HAL_AFIO_REMAP_SPI1_ENABLE();                                        \
    } while (0)
#define SPI1_SCK_PORT B
#define SPI1_SCK_PIN  GPIO_PIN_3
#if SPI1_NSS_ENABLE
#define SPI1_NSS_PORT A
#define SPI1_NSS_PIN  GPIO_PIN_15
#endif
#if SPI1_MISO_ENABLE
#define SPI1_MISO_PORT B
#define SPI1_MISO_PIN  GPIO_PIN_4
#endif
#if SPI1_MOSI_ENABLE
#define SPI1_MOSI_PORT B
#define SPI1_MOSI_PIN  GPIO_PIN_5
#endif
#else
#error "Invalid SPI1 IO Remap Configuration! "
#endif

