Deadline039/STM32F1xx-HAL-CSP/Config/CSP_Config.h
//   <e> SPI1 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI1_IT_ENABLE          0
//      <o> SPI1 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of SPI1
#define SPI1_IT_PRIORITY        2
//      <o> SPI1 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of SPI1
#define SPI1_IT_SUB             3
//   </e>

//   <e> DMA Rx
#define SPI1_RX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define SPI1_RX_DMA_NUMBER      1
//     <o>  Channel <2=>2
//     <i>  Selects DMA Channel (only Channel 2 can be used)
#define SPI1_RX_DMA_CHANNEL     2
//     <o SPI1_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define SPI1_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define SPI1_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define SPI1_RX_DMA_IT_SUB      2
//   </e>

//   <e> DMA Tx
#define SPI1_TX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define SPI1_TX_DMA_NUMBER      1
//     <o>  Channel <3=>3
//     <i>  Selects DMA Channel (only Channel 3 can be used)
#define SPI1_TX_DMA_CHANNEL     3
//     <o SPI1_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define SPI1_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define SPI1_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define SPI1_TX_DMA_IT_SUB      4
//   </e>

#endif /* SPI1_ENABLE */

// </e>

// <e> SPI2 (Serial Peripheral Interface 2)
// <i> SCK/PB13
#define SPI2_ENABLE             0

#if SPI2_ENABLE

//   <q> Enable SPI2 NSS  (PB12)
#define SPI2_NSS_ENABLE         0
//   <q> Enable SPI2 MISO (PB14)
#define SPI2_MISO_ENABLE        0
//   <q> Enable SPI2 MOSI (PB15)
#define SPI2_MOSI_ENABLE        0

#define SPI2_SCK_PORT           B
#define SPI2_SCK_PIN            GPIO_PIN_13

#if SPI2_NSS_ENABLE
#define SPI2_NSS_PORT A
#define SPI2_NSS_PIN  GPIO_PIN_12
#endif

#if SPI2_MISO_ENABLE
#define SPI2_MISO_PORT B
#define SPI2_MISO_PIN  GPIO_PIN_14
#endif

#if SPI2_MOSI_ENABLE
#define SPI2_MOSI_PORT B
#define SPI2_MOSI_PIN  GPIO_PIN_15
#endif

//   <e> SPI2 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI2_IT_ENABLE          0
//      <o> SPI2 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of SPI2
#define SPI2_IT_PRIORITY        2
//      <o> SPI2 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of SPI2
#define SPI2_IT_SUB             3
//   </e>

//   <e> DMA Rx
#define SPI2_RX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define SPI2_RX_DMA_NUMBER      1
//     <o>  Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
#define SPI2_RX_DMA_CHANNEL     4
//     <o SPI2_RX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define SPI2_RX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Rx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Rx
#define SPI2_RX_DMA_IT_PRIORITY 2
//     <o>  DMA Rx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Rx
#define SPI2_RX_DMA_IT_SUB      2
//   </e>

//   <e> DMA Tx
#define SPI2_TX_DMA             0
//     <o>  Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
#define SPI2_TX_DMA_NUMBER      1
//     <o>  Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
#define SPI2_TX_DMA_CHANNEL     5
//     <o SPI2_TX_DMA_PRIORITY> Priority
//      <DMA_PRIORITY_LOW=>Low
//      <DMA_PRIORITY_MEDIUM=>Medium
//      <DMA_PRIORITY_HIGH=>High
//      <DMA_PRIORITY_VERY_HIGH=>Very High
//     <i>  Set DMA Channel Priority
#define SPI2_TX_DMA_PRIORITY    DMA_PRIORITY_MEDIUM
//     <o>  DMA Tx Interrupt Priority <0-15>
//     <i>  The Interrupt Priority of DMA Tx
#define SPI2_TX_DMA_IT_PRIORITY 1
//     <o>  DMA Tx Interrupt SubPriority <0-15>
//     <i>  The Interrupt SubPriority of DMA Tx
#define SPI2_TX_DMA_IT_SUB      4
//   </e>

#endif /* SPI2_ENABLE */

// </e>

// <e> SPI3 (Serial Peripheral Interface 3)
#define SPI3_ENABLE             0

#if SPI3_ENABLE

//   <o> SPI3/I2S3 IO Remap (NSS->WS, MOSI->SD)
//        <0=>No remap   (NSS/PA15, SCK/PB3,  MISO/PB4,  MOSI/PB5 )
//        <1=>Remap      (NSS/PA4,  SCK/PC10, MISO/PC11, MOSI/PC12)
#define SPI3_IO_REMAP           0

//   <q> Enable SPI3 NSS
#define SPI3_NSS_ENABLE         0
//   <q> Enable SPI3 MISO
#define SPI3_MISO_ENABLE        0
//   <q> Enable SPI3 MOSI
#define SPI3_MOSI_ENABLE        0

#if (SPI3_IO_REMAP == 0)
#ifdef AFIO_MAPR_SPI3_REMAP
#define SPI3_AFIO_REMAP() __HAL_AFIO_REMAP_SPI3_ENABLE();
#else
#define SPI3_AFIO_REMAP()                                                      \
    do {                                                                       \
        __HAL_RCC_AFIO_CLK_ENABLE();                                           \
        __HAL_AFIO_REMAP_SWJ_NOJTAG();                                         \
    } while (0)
#endif // AFIO_MAPR_SPI3_REMAP

#define SPI3_SCK_PORT B
#define SPI3_SCK_PIN  GPIO_PIN_3
#if SPI3_NSS_ENABLE
#define SPI3_NSS_PORT A
#define SPI3_NSS_PIN  GPIO_PIN_15
#endif
#if SPI3_MISO_ENABLE
#define SPI3_MISO_PORT B
#define SPI3_MISO_PIN  GPIO_PIN_4
#endif
#if SPI3_MOSI_ENABLE
#define SPI3_MOSI_PORT B
#define SPI3_MOSI_PIN  GPIO_PIN_5
#endif
#elif (SPI3_IO_REMAP == 1)
#ifdef AFIO_MAPR_SPI3_REMAP
#define SPI3_AFIO_REMAP() __HAL_AFIO_REMAP_SPI3_ENABLE()
#else
#define SPI3_AFIO_REMAP()
#endif // AFIO_MAPR_SPI3_REMAP
#define SPI3_SCK_PORT C
#define SPI3_SCK_PIN  GPIO_PIN_10
#if SPI3_NSS_ENABLE
#define SPI3_NSS_PORT A
#define SPI3_NSS_PIN  GPIO_PIN_4
#endif
#if SPI3_MISO_ENABLE
#define SPI3_MISO_PORT C
#define SPI3_MISO_PIN  GPIO_PIN_11
#endif
#if SPI3_MOSI_ENABLE
#define SPI3_MOSI_PORT C
#define SPI3_MOSI_PIN  GPIO_PIN_12
#endif
#else
#error "Invalid SPI3 IO Remap Configuration! "
#endif

//   <e> SPI3 Interrupt
//   <i> Must be enabled when using DMA.
#define SPI3_IT_ENABLE          0
//      <o> SPI3 Interrupt Priority <0-15>
//      <i> The Interrupt Priority of SPI3
#define SPI3_IT_PRIORITY        2
//      <o> SPI3 Interrupt SubPriority <0-15>
//      <i> The Interrupt SubPriority of SPI3
#define SPI3_IT_SUB             3
//   </e>

